Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/local_authority_and_social_housing/housing_associations.html.txt.tmx
Source language: en
Languages: ga

source: Housing associations are independent, not-for-profit charities
ga: Carthanais neamhspleácha neamhbhrabúis iad comhlachais tithíochta (ar a dtugtar Comhlachtaí Faofa Tithíochta (CFTanna) nó comhlachais tithíochta deonacha)

source: In general, they provide affordable rented housing for people who cannot afford to pay private sector rents or buy their own homes, or for particular groups, such as older people or homeless people
ga: Soláthraíonn siad tithíochta inacmhainne ar cíos do dhaoine nach féidir leo íoc as cíosanna na hearnála príobháidí nó a dtithe féin a cheannach; nó do ghrúpaí ar leith, ar nós daoine breacaosta nó daoine gan dídean

source: Housing co-operatives are organisations of tenants or owners where the members share responsibility for the management and upkeep of their homes
ga: Bunaíonn eagraíochtaí reatha cúraim roinnt comhlachais tithíochta a sholáthraíonn seirbhísí do ghrúpaí riachtanas speisialta, ar nós daoine breacaosta nó daoine atá faoi mhíchumas

source: Tenant housing co-operatives are very similar to housing associations
ga: Cuireann roinnt comhlachas seirbhísí neamhthithíochta ar fáil, ar nós béilí grúpa, gníomhaíochtaí sóisialta agus comhairle faoi leas

source: This means that they have been approved under the Housing (Miscellaneous Provisions) Act 1992 for the purpose of accessing assistance from local authorities for housing provision
ga: Eagraíochtaí iad comharchumainn tithíochta ina bhfuil tionóntaí nó úinéirí sa chás go mbíonn na comhaltaí comhfhreagrach as bainistiú agus cothabháil a dtithe

source: While there are differences between the various types of organisation involved, the term “housing associations” is also often used to cover all voluntary housing organisations
ga: Tá comharchumainn tithíochta tionóntaí an-chosúil le comhlachais tithíochta

source: On 7 April 2016, approved housing bodies were brought under the remit of the Residential Tenancies Board (RTB) and they must now register their tenancies with the RTB
ga: D’fhonn tithíocht a fháil ó chomhlachas tithíochta, ní mór duit bheith cláraithe de ghnáth ar liosta feithimh tithíochta an údaráis áitiúil i do cheantar

source: There are over 500 approved housing bodies and they vary widely in size and in the services that they provide
ga: Bíonn na cearta céanna, go bunúsach, ag tionóntaí comhlachas tithíochta a bhíonn ag tionóntaí údaráis áitiúil

source: As well as providing affordable rented housing, they generally aim to encourage community development
ga: Níl an ceart ag tionóntaí comhlachas tithíochta, áfach, chun a dtithe a cheannach

source: Some facilitate people who wish to live in a different area
ga: Conas iarratas a dhéanamh

source: Examples of these are the Safe-Home programme, which is for older Irish-born emigrants living in rented accommodation who wish to return to Ireland, or Rural Resettlement Ireland, for urban dwellers wishing to resettle their families in a rural area
ga: Beidh rannóg tithíochta d’údaráis áitiúil in ann a rá duit an bhfuil comhlachais tithíochta gníomhach i do cheantar. Ina ionad sin, is féidir leat cuardach a dhéanamh d’fhaisnéis teagmhála faoi chomhlachais tithíochta anseo

source: In order to be housed by an approved housing body, you must normally be registered on the local authority housing waiting list in your area
ga: Is gnách go gcuireann comhlachais tithíochta tithíocht ar fáil do dhaoine a bhfuil a n-ainmneacha ar liosta tithíochta an údaráis áitiúil

source: To be registered on the housing waiting list, your income must be below a prescribed level. (There are 3 maximum income thresholds that apply to different local authorities.) You must also have a need for housing, that is, your current housing circumstances must be unsuitable
ga: Más mian leat go ndéanfar breithniú ort le haghaidh cóiríochta a sholáthraíonn comhlachas tithíochta nó comhlacht faofa tithíochta eile, cuir tic sa bhosca atá marcáilte “tithíocht dheonach/chomharchumainn” ar an bhfoirm iarratais nuair a dhéanann tú iarratais ar thithíocht shóisialta

source: Read more in our document on applying for local authority housing
ga: D’fhéadfadh roinnt comhlachas glacadh le hiarratais dhíreacha

source: If you want to be considered for housing provided by an approved housing body, make sure you tick the box marked “voluntary/co-operative housing” in the ‘Housing Requirements’ section of the application form
ga: Má tá tú ar liosta tithíochta an údaráis áitiúil, féadtar d’ainm a sheoladh ar aghaidh chuig comhlachas tithíochta

source: The housing department of your local authority will be able to tell you if there are approved housing bodies active in your area
ga: D’fhéadfadh roinnt comhlachas glacadh le hiarratais dhíreacha

source: In most cases, the local authority will refer you to an AHB if an appropriate vacancy arises
ga: Sa chás seo, déanann tú iarratas go díreach leis an gcomhlachas a roghnaigh tú

source: You can read more about approved housing bodies and view the register, which lists over 500 bodies that are currently approved. You can search for contact information here
ga: Tá a mbeartas féin agus a gcoinníollacha cáilitheacha féin ag gach comhlachas maidir le tithíocht a chur ar fáil d’iarratasóirí

source: The Irish Council for Social Housing can give you general information on housing associations
ga: Féadfaidh Comhairle um Thithíocht Shóisialta na hÉireann faisnéis ghinearálta a thabhairt duit ar chomhlachais tithíochta

source: Irish Council for Social Housing
ga: An Chomhairle na hÉireann do Tithiocht Shóisialta

source: Co-operative Housing Ireland (formerly called NABCO) is the national federation for the co-operative housing sector and can give you general information about housing co-operatives
ga: Féadfaidh an NABCO, Cumann Náisiúnta na gComharchumann Foirgníochta , faisnéis ghinearálta a thabhairt duit faoi chomharchumainn tithíochta
